#Installation script for binaries
#Author: Dave Hand
#Dependencies:
# *XCode
# *XCode Command Line Tools
# *Homebrew

tap 'caskroom/cask'
brew 'archey'
brew 'ag'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'cowsay'
brew 'cscope'
brew 'ctags'
brew 'fortune'
brew 'freetype'
brew 'git'
brew 'htop-osx'
brew 'httpie'
brew 'irssi'
brew 'jq'
brew 'libyaml' #required by rbenv
brew 'libffi' #required by rbenv
brew 'node'
brew 'openssl'
brew 'python' #installs pip as well
brew 'qt'
brew 'rbenv'
brew 'ruby-build'
brew 'readline'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget', args: ['with-iri']

#cask files
#Didn't install:
# *Wunderlist
# *Hearthstone
cask 'alfred'
cask 'amazon-music'
cask 'appcleaner'
cask 'battle-net' #installs setup, not actual app
cask 'doxie'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'intellij-idea'
cask 'iterm2'
cask 'keepingyouawake'
cask 'kindle'
cask 'openemu'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
