#Installation script for binaries
#Author: Dave Hand
#Dependencies:
# *XCode
# *XCode Command Line Tools
# *Homebrew

tap 'caskroom/cask'
brew 'archey'
brew 'ag'
brew 'bash'
brew 'bash-completion'
brew 'brew-cask'
brew 'coreutils'
brew 'cowsay'
brew 'cscope'
brew 'ctags'
brew 'fortune'
brew 'freetype'
brew 'git'
brew 'htop-osx'
brew 'httpie'
brew 'irssi'
brew 'libyaml' #required by rbenv
brew 'libffi' #required by rbenv
brew 'node'
brew 'openssl'
brew 'python' #installs pip as well
brew 'qt'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-gem-rehash' #automatically run rehash
brew 'readline'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget', args: ['with-iri']

#cask files
#Didn't install:
# *Photoshop
# *TrueCrypt
# *Wunderlist
# *Mint QuickView
# *TuneUp
# *Hearthstone
# *SquirrelSQL
# *Slingplayer-Chrome
cask 'java'
cask 'adium'
cask 'alfred'
cask 'amazon-music'
cask 'arduino'
cask 'battle-net' #installs setup, not actual app
cask 'caffeine'
cask 'calibre'
cask 'chromecast'
cask 'desmume'
cask 'doxie'
cask 'dropbox'
cask 'eclipse-jee'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'google-hangouts'
cask 'handbrake'
cask 'haskell-platform'
cask 'iterm2'
cask 'kindle'
cask 'lastpass' #installs installer, not actual app
cask 'mactex'
cask 'openemu'
cask 'pgadmin3'
cask 'skim'
cask 'spotify'
cask 'steam'
cask 'sublime-text'
cask 'teamviewer'
cask 'the-unarchiver'
cask 'torbrowser'
cask 'transmission'
cask 'vlc'
cask 'xquartz' #required by wireshark
cask 'wireshark'
